doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snipets. It is optional.
(setq user-full-name "klchen0112"
    user-mail-address "klchen0112@gmail.com")

(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

;; Simple Settings
(setq-default
 dired-dwim-target t
 history-length 1000
 create-lockfiles nil
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t                              ; Stretch cursor to the glyph width
)

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      truncate-string-ellipsis "…"                ; Unicode ellispis are nicer than "...", and also save /precious/ space
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      ;; scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      word-wrap-by-category t                     ; Different languages live together happily
      scroll-margin 2)                            ; It's nice to maintain a little margin
(setq which-key-idle-delay 0.3) ;; I need the help, I really do

;; Drag text from emacs to other apps
(setq
 mouse-drag-and-drop-region-cross-program t
 mouse-drag-and-drop-region t)
;;(pixel-scroll-mode)
;;(pixel-scroll-precision-mode 1)
;;(setq pixel-scroll-precision-large-scroll-height 60
;;     pixel-scroll-precision-interpolation-factor 30.0)

;; (display-time-mode 1)                             ; Enable time in the mode-line

(global-subword-mode 1)                           ; Iterate through CamelCase words
(global-visual-line-mode 1)                       ; Wrap lines at window edge, not at 80th character: my screen is wide enough!

(scroll-bar-mode 1)
;;(+global-word-wrap-mode +1)

;; Framing Size
;; start the initial frame maximized
;;(add-hook 'window-setup-hook #'toggle-frame-maximized)
;;(add-hook 'window-setup-hook #'toggle-frame-fullscreen)

;; no title bar
(add-to-list 'default-frame-alist '(undecorated . t))
(add-to-list 'default-frame-alist '(drag-internal-border . 1))
(add-to-list 'default-frame-alist '(internal-border-width . 5))
;; no round corners
;; (add-to-list 'default-frame-alist '(undecorated-round . t))

;; Doom exposes five (optional) variables for controlling fonts in Doom:
;;
;; - `doom-font' -- the primary font to use
;; - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
;; - `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;; - `doom-unicode-font' -- for unicode glyphs
;; - `doom-serif-font' -- for the `fixed-pitch-serif' face
;;
;; See 'C-h v doom-font' for documentaion and more examples of what they
;; accept. For example:


;; If you or Emacs can't find your font, use 'M-x describe-font' to look them
;; up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
;; refresh your font settings. If Emacs still can't find your font, it likely
;; wasn't installed correctly. Font issues are rarely Doom issues!
;; DON'T use (`font-family-list'), it's unreliable on Linux
;; org mode table


(setq auto-save-default t)

(cond
 (IS-MAC
  (setq doom-font (font-spec :family "Iosevka"   :size 19)
        doom-big-font (font-spec :family "Iosevka"  :size 36)
        doom-variable-pitch-font (font-spec :family "Overpass"  :size 23)
        ;;doom-unicode-font (font-spec :family "FZSongKeBenXiuKai-R-GBK" :weight 'light :slant 'italic :size 21)
        doom-serif-font (font-spec :family "IBM Plex Serif"  :size 23))
  (add-hook! 'after-init-hook
             :append
             (lambda ()
               ;; Emoji: 😄, 🤦, 🏴󠁧󠁢󠁳󠁣󠁴
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Apple Color Emoji" )  )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Symbola" )            )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Noto Color Emoji" )   )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Liberation Mono" )    )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Noto Sans Symbols2" ) )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Segoe UI Emoji" )     )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "FreeSerif" )         )
               (set-fontset-font "fontset-default" 'symbol (font-spec :family "Twitter Color Emoji" ))
               ;; East Asia: 你好, 早晨, こんにちは, 안녕하세요
               (set-fontset-font "fontset-default" 'han      (font-spec :family "LXGW WenKai"))
               (set-fontset-font "fontset-default" 'kana     (font-spec :family "LXGW WenKai"))
               (set-fontset-font "fontset-default" 'hangul   (font-spec :family "LXGW WenKai"))
               (set-fontset-font "fontset-default" 'cjk-misc (font-spec :family "Noto Serif CJK SC"))
               ;; Cyrillic: Привет, Здравствуйте, Здраво, Здравейте
               (set-fontset-font "fontset-default" 'cyrillic (font-spec :family "Noto cmd_Serif"))
               ))
  )

 (IS-WINDOWS
  (setq doom-font (font-spec :family "Cascadia Code"  :size 23)
        doom-big-font (font-spec :family "Cascadia Code"  :size 25)
        doom-variable-pitch-font (font-spec :family "Cascadia Code" :size 23)
        doom-unicode-font (font-spec :family "霞鹜文楷等宽" :weight 'light :size 23)
        doom-serif-font (font-spec :family "Cascadia Code"  :size 23)))
 )
