doom/config.el

(defconst meow-cheatsheet-layout-engram
    '((<TLDE> "[" "{")
      (<AE01> "1" "|")
      (<AE02> "2" "=")
      (<AE03> "3" "~")
      (<AE04> "4" "+")
      (<AE05> "5" "<")
      (<AE06> "6" ">")
      (<AE07> "7" "^")
      (<AE08> "8" "&")
      (<AE09> "9" "%")
      (<AE10> "0" "*")
      (<AE11> "]" "}")
      (<AE12> "/" "\\")
      (<AD01> "b" "B")
      (<AD02> "y" "Y")
      (<AD03> "o" "O")
      (<AD04> "u" "U")
      (<AD05> "''" "(")
      (<AD06> "\"" ")")
      (<AD07> "l" "L")
      (<AD08> "d" "D")
      (<AD09> "w" "W")
      (<AD10> "v" "v")
      (<AD11> "z" "Z")
      (<AD12> "#" "@")
      (<BKSL> "$" "`")
      (<AC01> "c" "C")
      (<AC02> "i" "i")
      (<AC03> "e" "E")
      (<AC04> "a" "A")
      (<AC05> "," ";")
      (<AC06> "." "\"")
      (<AC07> "h" "H")
      (<AC08> "t" "T")
      (<AC09> "s" "S")
      (<AC10> "n" "N")
      (<AC11> "q" "Q")
      (<AB01> "g" "G")
      (<AB02> "x" "X")
      (<AB03> "j" "J")
      (<AB04> "k" "K")
      (<AB05> "-" "_")
      (<AB06> "?" "!")
      (<AB07> "r" "R")
      (<AB08> "m" "M")
      (<AB09> "f" "f")
      (<AB10> "p" "P")
      (<LSGT> "-" "_")))


(defun meow/setup-leader ()
  (map! :leader
        "?" #'meow-cheatsheet
        "/" #'meow-keypad-describe-key
        "1" #'meow-digit-argument
        "2" #'meow-digit-argument
        "3" #'meow-digit-argument
        "4" #'meow-digit-argument
        "5" #'meow-digit-argument
        "6" #'meow-digit-argument
        "7" #'meow-digit-argument
        "8" #'meow-digit-argument
        "9" #'meow-digit-argument
        "0" #'meow-digit-argument))

(defun meow/setup-doom-keybindings()
  (map! :map meow-normal-state-keymap
        doom-leader-key doom-leader-map)
  (map! :map meow-motion-state-keymap
        doom-leader-key doom-leader-map)
  (map! :map meow-beacon-state-keymap
        doom-leader-key nil)
  (meow/setup-leader)
  )
(defun set-useful-keybindings()
  ;;(keymap-set doom-leader-workspaces/windows-map "t" 'treemacs-select-window)
  ;;(keymap-global-set "M-j" 'kmacro-start-macro-or-insert-counter)
  ;;(keymap-global-set "M-k" 'kmacro-end-or-call-macro)
  ;; for doom emacs buffer management
  (map! :leader
        ;; make doom-leader-buffer-map alive
        (:prefix-map ("b" . "buffer")
         :desc "Toggle narrowing"            "-"   #'doom/toggle-narrow-buffer
         :desc "Previous buffer"             "["   #'previous-buffer
         :desc "Next buffer"                 "]"   #'next-buffer
         (:when (modulep! :ui workspaces)
           :desc "Switch workspace buffer"    "b" #'persp-switch-to-buffer
           :desc "Switch buffer"              "B" #'switch-to-buffer)
         (:unless (modulep! :ui workspaces)
           :desc "Switch buffer"               "b"   #'switch-to-buffer)
         :desc "Clone buffer"                "c"   #'clone-indirect-buffer
         :desc "Clone buffer other window"   "C"   #'clone-indirect-buffer-other-window
         :desc "Kill buffer"                 "d"   #'kill-current-buffer
         :desc "ibuffer"                     "i"   #'ibuffer
         :desc "Kill buffer"                 "k"   #'kill-current-buffer
         :desc "Kill all buffers"            "K"   #'doom/kill-all-buffers
         :desc "Switch to last buffer"       "l"   #'evil-switch-to-windows-last-buffer
         :desc "Set bookmark"                "m"   #'bookmark-set
         :desc "Delete bookmark"             "M"   #'bookmark-delete
         :desc "Next buffer"                 "n"   #'next-buffer
         :desc "New empty buffer"            "N"   #'+default/new-buffer
         :desc "Kill other buffers"          "O"   #'doom/kill-other-buffers
         :desc "Previous buffer"             "p"   #'previous-buffer
         :desc "Revert buffer"               "r"   #'revert-buffer
         :desc "Save buffer"                 "s"   #'basic-save-buffer
         ;;:desc "Save all buffers"            "S"   #'evil-write-all
         :desc "Save buffer as root"         "u"   #'doom/sudo-save-buffer
         :desc "Pop up scratch buffer"       "x"   #'doom/open-scratch-buffer
         :desc "Switch to scratch buffer"    "X"   #'doom/switch-to-scratch-buffer
         :desc "Bury buffer"                 "z"   #'bury-buffer
         :desc "Kill buried buffers"         "Z"   #'doom/kill-buried-buffers)
        )
  )

(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-engram)
  (set-useful-keybindings)
  (meow/setup-doom-keybindings)
  ;; for doom emacs
  ;;(add-to-list 'meow-keymap-alist (cons 'leader doom-leader-map))
  ;;(meow-normal-define-key (cons "SPC" doom-leader-map))
  ;;(meow-motion-overwrite-define-key (cons "SPC" doom-leader-map))
  (map!
   (:when (modulep! :ui workspaces)
     :n "C-t"   #'+workspace/new
     :n "C-S-t" #'+workspace/display
     :g "M-1"   #'+workspace/switch-to-0
     :g "M-2"   #'+workspace/switch-to-1
     :g "M-3"   #'+workspace/switch-to-2
     :g "M-4"   #'+workspace/switch-to-3
     :g "M-5"   #'+workspace/switch-to-4
     :g "M-6"   #'+workspace/switch-to-5
     :g "M-7"   #'+workspace/switch-to-6
     :g "M-8"   #'+workspace/switch-to-7
     :g "M-9"   #'+workspace/switch-to-8
     :g "M-0"   #'+workspace/switch-to-final
     ))
  (meow-motion-overwrite-define-key
   '("j" . meow-next)
   '("k" . meow-prev))

  (meow-leader-define-key
   ;; SPC j/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet)
   )

  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("1" . meow-expand-1)
   '("2" . meow-expand-2)
   '("3" . meow-expand-3)
   '("4" . meow-expand-4)
   '("5" . meow-expand-5)
   '("6" . meow-expand-6)
   '("7" . meow-expand-7)
   '("8" . meow-expand-8)
   '("9" . meow-expand-9)
   '("-" . negative-argument)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("/" . meow-visit)
   '("a" . meow-append)
   '("A" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("C" . meow-cancel)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("f" . meow-right)
   '("f" . meow-right-expand)
   '("g" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-head)
   '("H" . meow-head-expand)
   '("i" . meow-insert)
   '("I" . meow-open-above)
   '("j" . meow-join)
   '("J" . meow-join-sexp)
   '("k" . meow-kill)
   '("K" . meow-keypad)
   '("l" . meow-line)
   '("L" . meow-goto-line)
   '("m" . meow-mark-word)
   '("M" . meow-mark-symbol)
   '("n" . meow-next)
   '("N" . meow-next-expand)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-prev)
   '("P" . meow-prev-expand)
   '("q" . meow-quit)
   '("r" . meow-replace)
   '("r" . meow-swap-grab)
   '("s" . meow-save)
   '("S" . meow-search)
   '("t" . meow-till)
   '("T" . meow-find)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("w" . meow-next-word)

   ;;'("W" . meow-next-symbol)
   '("x" . meow-M-x)

   ;;'("X" . meow-backward-delete)
   '("y" . meow-yank)
   '("Y" . meow-sync-grab)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("\\" . qutoed-insert)
   '("<escape>" . ignore))

  (setq meow-expand-exclude-mode-list nil)
  (setq meow-expand-hint-remove-delay 1024)

  (setq meow-use-clipboard t
        meow-visit-sanitize-completion nil
        meow-expand-exclude-mode-list nil
        meow-expand-hint-remove-delay 1024
   )

)

(use-package! meow
  :config
  (meow-setup)
  (meow-global-mode 1)
)
