doom/config.org
* Biblio
** init biblio
#+begin_src emacs-lisp :tangle config.el

(setq my/bib (concat "~/org/" "academic.bib"))
(setq my/notes (concat "~/org/" "references"))
(setq my/library-files "~/Documents/org-pdfs")
#+end_src
** zotero

#+begin_src emacs-lisp :tangle packages.el
;; (package! zotxt)
#+end_src
** ebib
#+begin_src emacs-lisp :tangle packages.el
;;(package! ebib)
#+end_src
** org-ref
#+begin_src emacs-lisp :tangle packages.el
(package! org-ref)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package org-ref)
#+end_src

** bibtex-completion
#+begin_src emacs-lisp :tangle packages.el
(package! bibtex-completion)
#+end_src


#+begin_src emacs-lisp :tangle config.el
(use-package! bibtex-completion
  :config
  (setq
  bibtex-completion-bibliography my/bib
  bibtex-completion-pdf-field "file"
  bibtex-completion-notes-path my/notes
  bibtex-completion-additional-search-fields '(keywords)
  bibtex-completion-display-formats
	'((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
	  (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
	  (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}")))
  bibtex-completion-notes-template-multiple-files
    (concat
    "#+TITLE: ${title}\n"
    "#+filetags: ${keywords}\n"
    "* TODO Notes\n"
    ":PROPERTIES:\n"
    ":ID: ${=key=}\n"
    ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
    ":AUTHOR: ${author-abbrev}\n"
    ":JOURNAL: ${journaltitle}\n"
    ":DATE: ${date}\n"
    ":YEAR: ${year}\n"
    ":DOI: ${doi}\n"
    ":URL: ${url}\n"
    ":END:\n\n")
)


#+end_src
** citar
citar need vertico
#+begin_src emacs-lisp conf :tangle packages.el

(package! citar)
(package! embark)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! citar
  :config
  (setq citar-bibliography my/bib
        citar-notes-paths '("~/org/references/")
        )

  (setq
   org-cite-insert-processor 'citar
   org-cite-follow-processor 'citar
   org-cite-activate-processor 'citar

   citar-default-action 'citar-open-notes

   citar-at-point-function 'citar-dwim

   citar-file-note-org-include '(org-id org-roam-ref))
  (setq citar-templates
        '((main . "${author editor:30}     ${date year issued:4}     ${title:55}")
          (suffix . "  ${tags keywords:40}")
          (preview . "${author editor} ${title}, ${journal publisher container-title collection-title booktitle} ${volume} (${year issued date}).\n")
          (note .
                "${title}\n#+filetags: :references:
- bibliography ::
- tags :: ${tags}
- keywords :: ${keywords}
- previous work :: \n* Notes
:PROPERTIES:
:Custom_ID: ${=key=}
:URL: ${url}
:AUTHOR: ${author}
:NOTER_DOCUMENT: ${file}
:NOTER_PAGE:
:NOANKI: t
:END:"
                ))))

(use-package! citar-embark
  :after citar embark
  :config (citar-embark-mode)
  )
#+end_src
** org roam bibtex
#+begin_src emacs-lisp :tangle packages.el
;; interact with org-roam and bibtex
(package! org-roam-bibtex)

;; doom support
;;(package! citar-org-roam
;;     :recipe (:host github :repo "emacs-citar/citar-org-roam"
;;           :files ("*.el")))

#+end_src


#+begin_src emacs-lisp conf :tangle config.el
;; Org-Roam-Bibtex
(use-package! org-roam-bibtex
 :after org-roam
 :hook
 (org-mode . org-roam-bibtex-mode)
 :custom
 (orb-note-actions-interface 'default)
 :config
 (setq
  orb-preformat-keywords
  '("citekey" "title" "url" "file" "author-or-editor" "keywords")
  orb-insert-link-description 'title
  orb-roam-ref-format 'org-cite ;; using org ref version3
  orb-process-file-keyword t
  orb-attached-file-extensions '("pdf")
  org-cite-insert-processor 'citar
  org-cite-follow-processor 'citar
  org-cite-activate-processor 'citar
  citar-at-point-function 'embark-act
  citar-file-note-org-include '(org-id org-roam-ref)
  orb-insert-generic-candidates-format '("title" "author-or-editor" "keyword"))
 (add-to-list 'org-roam-capture-templates
                ;; bibliography note template
                '("r" "bibliography reference" plain
                 (file  "~/org/templates/orb_template.org")
                 :if-new
                 (file+head "references/${citekey}.org" "#+title: ${title}\n#+filetags: :references:\n")
                 :unnarrowed t))
 (add-to-list 'org-roam-capture-templates
              '("s" "short bibliography reference (no id)"
                  entry "* ${title} [cite:@%^{citekey}]\n%?"
                 :target (node "b93ffb0a-9383-4255-80ed-1142639fa458")
                 :unnarrowed t
                 :empty-lines-before 1
                 :prepend t))
)


(use-package! citar-org-roam
  :after citar org-roam
  :hook (org-roam-mode . citar-org-roam-mode)
  :config
  (setq citar-org-roam-note-title-template (cdr (assoc 'note citar-templates)))
)
#+end_src

* org mode
** org latex
*** packages
#+begin_src emacs-lisp :tangle packages.el
(package! org :recipe (:host nil :repo "https://git.tecosaur.net/tec/org-mode.git" :branch "dev" :remote "tecosaur"))
#+end_src
*** config
#+begin_src emacs-lisp

#+end_src
** 设置 org-variable
#+begin_src emacs-lisp conf :tangle config.el

(setq org_notes  "~/org/"
      org-directory org_notes)

#+end_src
** 设置 org 常用设置
:PROPERTIES:
:ID:       3fcd76df-a2bc-4291-9012-9ed3d1acc490
:END:
#+begin_src emacs-lisp :tangle config.el
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!

(use-package! org
  :config
  ;; pretty org files
  (setq org-auto-align-tags nil
        org-tags-column 0
        org-catch-invisible-edits 'show-and-error

        ;; Org styling, hide markup etc.
        org-hide-emphasis-markers t
        org-pretty-entities t

  )
  (setq org-ellipsis " ⭍")
  (setq  org-adapt-indentation nil)
  (setq  org-hidden-keywords nil)
  (setq  org-hide-emphasis-markers t)
  (setq  org-hide-leading-stars nil)
  (setq  org-image-actual-width '(300))
  (setq  org-imenu-depth 1)
  (setq  org-pretty-entities t)
  (setq  org-startup-folded t)
  (setq org-startup-with-inline-images t)
  (setq org-hide-leading-stars t)
  (setq org-use-property-inheritance t)              ; it's convenient to have properties inherited
  (setq org-log-done 'time             )             ; having the time a item is done sounds convenient
  (setq org-export-in-background t)                  ; run export processes in external emacs process
  (setq org-catch-invisible-edits 'smart)            ; try not to accidently do weird stuff in invisible regions
  (setq org-export-with-sub-superscripts '{})        ; don't treat lone _ / ^ as sub/superscripts, require _{} / ^{}
  (setq org-special-ctrl-a/e t
        org-hide-leading-stars t) ;; When t, C-a will bring back the cursor to the beginning of the headline text, i.e. after the stars and after a possible TODO keyword.
  (setq org-src-tab-acts-natively t) ;; source block 缩进
  :custom-face
  (org-level-1 ((t (:height 1.15))))
  (org-level-2 ((t (:height 1.13))))
  (org-level-3 ((t (:height 1.11))))
  (org-level-4 ((t (:height 1.09))))
  (org-level-5 ((t (:height 1.07))))
  (org-level-6 ((t (:height 1.05))))
  (org-level-7 ((t (:height 1.03))))
  (org-level-8 ((t (:height 1.01))))
  (org-todo ((t (:inherit 'fixed-pitch))))
  (org-done ((t (:inherit 'fixed-pitch))))
  (org-ellipsis ((t (:inherit 'fixed-pitch))))
  (org-property-value ((t (:inherit 'fixed-pitch))))
  (org-special-keyword ((t (:inherit 'fixed-pitch))))
)

#+end_src

