doom/config.el

(use-package! org-superstar
  :after org
  :custom
  (org-superstar-headline-bullets-list '("☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷"))
  (org-superstar-item-bullet-alist '((43 . "⬧") (45 . "⬨")))
  :custom-face
  (org-superstar-item ((t (:inherit 'fixed-pitch))))
  (org-superstar-header-bullet ((t (:height 232 :inherit 'fixed-pitch)))))

(use-package! visual-fill-column
  :after org
  :custom
  (visual-fill-column-width 80))

(use-package! org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq org-modern-star ["◉" "✜" "✸" "✿" "✤" "○" "◆" "▶"]
        org-modern-table-vertical 1
        org-modern-table-horizontal 0.2
        org-modern-list '((43 . "➤")
                          (45 . "-")
                          (42 . "•"))
        org-modern-todo-faces
        '(("TODO" :inverse-video t :inherit org-todo)
          ("PROJ" :inverse-video t :inherit +org-todo-project)
          ("STRT" :inverse-video t :inherit +org-todo-active)
          ("[-]"  :inverse-video t :inherit +org-todo-active)
          ("HOLD" :inverse-video t :inherit +org-todo-onhold)
          ("WAIT" :inverse-video t :inherit +org-todo-onhold)
          ("[?]"  :inverse-video t :inherit +org-todo-onhold)
          ("KILL" :inverse-video t :inherit +org-todo-cancel)
          ("NO"   :inverse-video t :inherit +org-todo-cancel))
        org-modern-footnote
        (cons nil (cadr org-script-display))
        org-modern-progress nil
        org-modern-priority nil
        org-modern-keyword
        '((t . t)
          ("title" . "𝙏")
          ("subtitle" . "𝙩")
          ("author" . "𝘼")
          ("email" . #("" 0 1 (display (raise -0.14))))
          ("date" . "𝘿")
          ("filetags" "")
          ("property" . "☸")
          ("options" . "⌥")
          ("startup" . "⏻")
          ("macro" . "𝓜")
          ("bind" . #("" 0 1 (display (raise -0.1))))
          ("bibliography" . "")
          ("print_bibliography" . #("" 0 1 (display (raise -0.1))))
          ("cite_export" . "⮭")
          ("import" . "⇤")
          ("setupfile" . "⇚")
          ("html_head" . "🅷")
          ("html" . "🅗")
          ("latex_class" . "🄻")
          ("latex_class_options" . #("🄻" 1 2 (display (raise -0.14))))
          ("latex_header" . "🅻")
          ("latex_header_extra" . "🅻⁺")
          ("latex" . "🅛")
          ("beamer_theme" . "🄱")
          ("beamer_color_theme" . #("🄱" 1 2 (display (raise -0.12))))
          ("beamer_font_theme" . "🄱𝐀")
          ("beamer_header" . "🅱")
          ("beamer" . "🅑")
          ("attr_latex" . "🄛")
          ("attr_html" . "🄗")
          ("attr_org" . "⒪")
          ("call" . #("" 0 1 (display (raise -0.15))))
          ("name" . "⁍")
          ("header" . "›")
          ("caption" . "☰")
          ("RESULTS" . "🠶")))
  (custom-set-faces! '(org-modern-statistics :inherit org-checkbox-statistics-todo))
)

;;(use-package! valign
;;  :hook
;;  (org-mode . valign-mode)
;;  (markdown-mode . valign-mode)
;;  :config
;;  (setq valign-fancy-bar 1)
;;)

(use-package! org-ol-tree
  :commands org-ol-tree
  :config
  (setq org-ol-tree-ui-icon-set
        (if (and (display-graphic-p)
                 (fboundp 'all-the-icons-material))
            'all-the-icons
          'unicode))
  (org-ol-tree-ui--update-icon-set))

(map! :map org-mode-map
      :after org
      :localleader
      :desc "Outline" "O" #'org-ol-tree)

;; config org download
(use-package! org-download
  :after org
  :config
  (setq org-download-method 'attach
        org-download-image-dir "~/Documents/org-attach")
)

;; config org-mode
;;(use-package! org-mind-map
;;  :config
;;  (setq org-mind-map-engine "dot")
;;)

;; config org brain
;;(use-package! org-brain
;;  :after org
;;  :hook
;;  (before-save-hook . #'org-brain-ensure-ids-in-buffer)
;;  :init
;;  (setq org-brain-path (concat org-directory "brain"))
;;  ;; For Evil users
;;  (with-eval-after-load 'evil
;;    (evil-set-initial-state 'org-brain-visualize-mode 'emacs))
;;  :config
;;  (setq org-id-track-globally t)
;;  (setq org-id-locations-file (concat org-directory ".orgids"))
;;  (add-hook 'before-save-hook )
;;  (setq org-brain-visualize-default-choices 'all)
;;  (setq org-brain-title-max-length 12)
;;  (setq org-brain-include-file-entries nil
;;        org-brain-file-entries-use-title nil))

;; Allows you to edit entries directly from org-brain-visualize
;;(use-package! polymode
;;  :config
;;  (add-hook 'org-brain-visualize-mode-hook #'org-brain-polymode))

(use-package! org-agenda
  :after org
  :config
  (setq org-agenda-files '("~/org/pages/TODO.org"))
  ;; 时间前导0
  (setq org-agenda-time-leading-zero t)
  ;; 默认显示区间
  (setq org-agenda-span 7)
  ;; agenda view 默认从周一开始显示
  (setq org-agenda-start-on-weekday 1)
   ;; Agenda styling
   (setq org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")
)

;;(use-package! org-re-reveal
;;  :after org
;;  :config
;;  (setq org-re-reveal-width 1200)
;;  (setq org-re-reveal-height 1000)
;;  (setq org-re-reveal-margin "0.1")
;;  (setq org-re-reveal-min-scale "0.5")
;;  (setq org-re-reveal-max-scale "2.5")
;;  (setq org-re-reveal-transition "cube")
;;  (setq org-re-reveal-control t)
;;  (setq org-re-reveal-center t)
;;  (setq org-re-reveal-progress t)
;;  (setq org-re-reveal-history nil)
;;)



(use-package! org-capture
  :after org
  )

(use-package! ox-hugo
  :after org-capture ox
)

(use-package! org-roam
  :after org
