doom/packages.el

(package! org-modern)
;;(package! valign :recipe (:host github :repo "casouri/valign"))
(package! org-superstar)

(package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))

(package! org-graph-view :recipe (:host github :repo "alphapapa/org-graph-view"))

(package! org-download)

;;(package! org-mind-map :recipe (:host github :repo "the-ted/org-mind-map"
;;                                :files ("*.el")))

;;(package! org-brain)
;;(package! polymode)

;;(package! doct
;;  :recipe (:host github :repo "progfolio/doct"))

(unpin! org-roam)
(package! org-roam)
