doom/packages.el
;;(package! tempel-collection)

(package! corfu :recipe (:files ("*.el" "extensions/*.el")))
(package! cape)
(package! dabbrev)
(when (modulep! +icons)
  (package! kind-icon))
(when (modulep! :os tty)
  (package! corfu-terminal))

(if IS-MAC (package! micromamba))

;;(when (executable-find "xelatex")
;;  (package! xenops)
;;)

;;(package! org-xlatex :recipe (:host github :repo "ksqsf/org-xlatex"))

(package! org-preview :recipe (:host github :repo "karthink/org-preview"))

(if IS-MAC (package! dash-at-point))

(unpin! pdf-tools)
