doom/config.org
** pdf tools
#+begin_src emacs-lisp :tangle packages.el
(unpin! pdf-tools)
#+end_src
** org noter and nov
#+begin_src emacs-lisp :tangle packages.el
(package! org-noter :recipe (:host github :repo "org-noter/org-noter"))

;;(package! org-noter-plus :recipe (:host github :repo "yuchen-lea/org-noter-plus"))
#+end_src


#+begin_src emacs-lisp :tangle config.el
(use-package! org-noter
  :after org
  :config
  (setq org-noter-notes-search-path (concat org-directory "references"))
  (setq org-noter-alway-create-frame t)
  (setq org-noter-auto-save-last-location t)
  (setq org-noter-doc-split-fraction '(0.52 0.48))
)


(after! org-noter
  (defun eli/org-noter-set-highlight (&rest _arg)
    "Highlight current org-noter note."
    (save-excursion
      (with-current-buffer (org-noter--session-notes-buffer org-noter--session)
        (remove-overlays (point-min) (point-max) 'org-noter-current-hl t)
        (goto-char (org-entry-beginning-position))
        (let* ((hl (org-element-context))
               (hl-begin (plist-get  (plist-get hl 'headline) :begin))
               (hl-end (1- (plist-get  (plist-get hl 'headline) :contents-begin)))
               (hl-ov (make-overlay hl-begin hl-end)))
          (overlay-put hl-ov 'face 'mindre-keyword)
          (overlay-put hl-ov 'org-noter-current-hl t))
        (org-cycle-hide-drawers 'all))))
  (advice-add #'org-noter--focus-notes-region
              :after #'eli/org-noter-set-highlight)
  (advice-add #'org-noter-insert-note
              :after #'eli/org-noter-set-highlight)


)

;;(use-package! org-noter-nov-overlay)

;;(use-package! org-noter-plus
;;  :commands (org-noter-plus--follow-nov-link)
;;  :config
;;  (setq org-noter-plus-image-dir "~/org/.attach/") ;; Directory to store images extracted from pdf files
;;)
;;
;;(after! nov
;;  (org-link-set-parameters "nov"
;;                           ;; Replace the default nov link to work better with org-noter
;;                           :follow 'org-noter-plus--follow-nov-link)
;;  )
#+end_src
** org media note
#+begin_src emacs-lisp :tangle packages.el
;;(package! pretty-hydra)  ;; dependency
;;(package! org-media-note :recipe (:host github :repo "yuchen-lea/org-media-note"))
#+end_src


#+begin_src emacs-lisp :tangle config.el
;;(use-package! org-media-note
;;  :init (setq org-media-note-use-org-ref t)
;;  :hook (org-mode .  org-media-note-mode)
;;  :after org
;;  :bind (("H-v" . org-media-note-hydra/body))  ;; Main entrance
;;  :config
;;  (setq org-media-note-screenshot-image-dir "~/org/.attach/")  ;; Folder to save screenshot
;;  (setq org-media-note-use-refcite-first t)  ;; use videocite link instead of video link if possible
;;  )
#+end_src
** mpvi

#+begin_src emacs-lisp :tangle packages.el
(package! mpvi :recipe (:host github :repo "lorniu/mpvi"))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! mpvi)
#+end_src
* Other module
** Git Module
** Time tracking
#+begin_src emacs-lisp :tangle packages.el
;;(package! wakatime-mode)
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;(use-package! wakatime-mode
;;  :config
;; (setq wakatime-cli-path       (cond (IS-MAC "~/.nix-profile/bin/wakatime-cli") (IS-WINDOWS "~/.wakatime/wakatime-cli")))
;;  (global-wakatime-mode)
;;)
#+end_src
** Keyfreq

#+begin_src emacs-lisp :tangle packages.el
(package! keyfreq)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(setq keyfreq-mode t
      keyfreq-autosave-mode t)
#+end_src
